
## Plan Result (terraform/aws/users)

[CI link](https://github.com/boxp/arch/actions/runs/13867190425)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_user.cursor_readonly
  * aws_iam_user_policy_attachment.cursor_readonly_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_user.cursor_readonly will be created
  + resource "aws_iam_user" "cursor_readonly" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "cursor-readonly"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.cursor_readonly_policy will be created
  + resource "aws_iam_user_policy_attachment" "cursor_readonly_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + user       = "cursor-readonly"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2999,"Program":"tfcmt","SHA1":"a8e98f77d0e4e31d9073612491011da65f6f1093","Target":"terraform/aws/users","Vars":{},"WorkflowName":"pull_request_target"} -->